Catalogs/АссортиментБлюд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>АссортиментБлюд</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияБлюда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорияБлюд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесГотовогоБлюда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Калорийность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ФормаСоздатьНайтиБлюдо/Ext/Form/Module.bsl
&НаСервере
Процедура НайтиБлюдоНаСервере()
	ЭлементПоиска = Справочники.АссортиментБлюд.НайтиПоНаименованию(ТРег(Блюдо));
	
	Если ЭлементПоиска.Наименование = ТРег(Блюдо) Тогда
	
		Сообщить("Блюдо найдено!");
		КатегорияБлюда = ЭлементПоиска.КатегорияБлюда;
		ВесГотовогоБлюда = ЭлементПоиска.ВесГотовогоБлюда;
		Калорийность = ЭлементПоиска.Калорийность;
		Состав = ЭлементПоиска.Состав;
		Цена = ЭлементПоиска.Цена;
		
	Иначе      
		
		Сообщить("Блюдо необходимо добавить");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиБлюдо(Команда)
	НайтиБлюдоНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьБлюдоНаСервере()
	
	ЭлементПоиска = Справочники.АссортиментБлюд.НайтиПоНаименованию(ТРег(Блюдо)); 
	
	Если Не ЭлементПоиска.Наименование = ТРег(Блюдо) Тогда  
		Справочники.АссортиментБлюд.СоздатьБлюдо(ТРег(Блюдо), КатегорияБлюда, ВесГотовогоБлюда, Состав, Калорийность, Цена);
		Сообщить("Блюдо добавлено"); 
	Иначе
		Сообщить("Блюдо уже есть в ассортименте блюд");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлюдо(Команда)
	СоздатьБлюдоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЕдИзмВес = "г.";
	ЭтаФорма.ЕдИзмК = "ккал.";
	ЭтаФорма.ЕдИзмЦ = "руб.";
КонецПроцедуры
